Revit 2024 API
FabricSheet.CutOverallLength Property
 The sheet length after cutting has taken place.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double CutOverallLength { get; }
Visual Basic
Public ReadOnly Property CutOverallLength As Double
	Get
Visual C++
public:
property double CutOverallLength {
	double get ();
}
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace